Repository: Python3pkg/PAMMySQLTools
Catalog: pammysqltools/locales/*/LC_MESSAGES/messages.po
Languages: de_de

source: {progname}: Invalid configuration: UID_MIN ({uid_min}), UID_MAX ({uid_max})
de_de: {progname}: Ungültige Konfiguration: UID_MIN ({uid_min}, UID_MAX({uid_max})

source: {progname}: Invalid configuration: SYS_UID_MIN ({sys_uid_min}), UID_MIN ({uid_min}), SYS_UID_MAX ({sys_uid_max})
de_de: {progname}: Ungültige Konfiguration: SYS_UID_MIN ({sys_uid_min}), UID_MIN ({uid_min}), SYS_UID_MAX ({sys_uid_max})

source: base directory for the home directory of the new account
de_de: Basisverzeichnis für das Home-Verzeichnis des neuen Benutzers

source: BASE_DIR
de_de: BASIS_VERZ

source: GECOS field of the new account
de_de: KOMMENTAR für das GECOS-Feld des neuen Benutzers

source: COMMENT
de_de: KOMMENTAR

source: home directory of the new account
de_de: Home-Verzeichnis des neuen Benutzers

source: HOME_DIR
de_de: HOME_VERZ

source: expiration date of the new account
de_de: Das Ablaufdatum des neuen Benutzerzugangs

source: EXPIRE_DATE
de_de: ABL_DATUM

source: password inactivity period of the new account
de_de: Passwort nach Ablauf von INAKTIV deaktivieren

source: INACTIVE
de_de: INAKTIV

source: name or ID of the primary group of the new account
de_de: Name oder ID der primären Gruppe des neuen Benutzerzugangs

source: GROUP
de_de: GRUPPE

source: list of supplementary groups of the new account
de_de: Liste der zusätzlichen Gruppen für den neuen Benutzerzugang

source: GROUPS
de_de: GRUPPEN

source: use this alternative skeleton directory
de_de: Ein alternatives skeleton-Verzeichnis (Vorlagenverzeichnis) verwenden

source: SKEL_DIR
de_de: SKEL_VERZ

source: override /etc/login.defs defaults
de_de: Die Vorgabewerte in /etc/login.defs überschreiben

source: KEY=VALUE
de_de: SCHLÜSSEL=WERT

source: do not create the user's home directory
de_de: Kein Home-Verzeichnis für den Benutzer erstellen

source: do not create a group with the same name as the user
de_de: Keine Gruppe mit dem gleichen Namen wie dem des Benutzers erstellen

source: allow to create users with duplicate (non-unique) UID
de_de: Benutzer mit doppelter (nicht einmaliger) UID erlauben

source: encrypted password of the new account
de_de: Verschlüsseltes Passwort für den neuen Benutzerzugang

source: PASSWORD
de_de: PASSWORT

source: create a system account
de_de: Eine Systemgruppe erstellen

source: login shell of the new account
de_de: Die Login-Shell des neuen Benutzerzugangs

source: user ID of the new account
de_de: Benutzer-ID (UID) des neuen Benutzerzugangs

source: path to the config file for this tool
de_de: Pfad zur Konfigurationsdatei dieses Tools

source: CONF_PATH
de_de: CONF_PFAD

source: Error: UID already taken
de_de: Fehler: UID schon vergeben

source: Error: Login name already taken
de_de: Fehler: Benutzername schon vergeben

source: Error: Insufficient permissions to create home dir
de_de: Fehler: Unzureichende Berechtigungen zur Erstellung des Home-Verzeichnisses

source: Error: Directory "%s" already exists
de_de: Fehler: Ordner "%s" existiert bereits

source: Warning: Can't find group {group}
de_de: Warnung: Kann Gruppe {group} nicht finden

source: force removal of files, even if not owned by user
de_de: Entfernen von Dateien erzwingen, auch wenn sie nicht Eigentum des zu löschenden Benutzers sind

source: remove home directory and mail spool
de_de: Entferne Home-Verzeichnis und Mail-Warteschlange

source: Error: User not found
de_de: Fehler: Benutzer nicht gefunden

source: Error: User not in database
de_de: Fehler: Benutzer nicht in Datenbank

source: Warning: Primary group "{group}" of user is empty but not in Database. Try "groupdel {group}"
de_de: Warnung: Die primäre Gruppe {group}" des Benutzers ist nicht in der Datenbank. Versuchen Sie "groupdel {group}"

source: new value of the GECOS field
de_de: Neuer KOMMENTAR im GECOS-Feld

source: new home directory for the user account
de_de: Neues Home-Verzeichnis für den Benutzerzugang

source: set account expiration date to EXPIRE_DATE
de_de: Ablaufdatum auf ABL_DATUM setzen

source: set password inactive after expiration to INACTIVE
de_de: Passwort nach Ablauf von INAKTIV deaktivieren

source: force use GROUP as new primary group
de_de: Erzwinge GRUPPE als neue primäre Gruppe

source: new list of supplementary GROUPS
de_de: Neue Liste zusätzlicher GRUPPEN

source: append the user to the supplemental GROUPS mentioned by the -G option without removing him/her from other groups
de_de: Benutzer zu zusätzlichen Gruppen hinzufügen, die mit der Option -G angegeben werden, ohne ihn dabei aus anderen Gruppen zu entfernen

source: new value of the login name
de_de: Neuer Wert für den Namen des Benutzerzugangs

source: NEW_LOGIN
de_de: NEUER_NAME

source: lock the user account
de_de: Den Benutzerzugang sperren

source: move contents of the home directory to the new location (use only with -d)
de_de: Den Inhalt des Home-Verzeichnisses an den neuen Ort verschieben (nur mit -d benutzen)

source: allow using duplicate (non-unique) UID
de_de: Benutzung von doppelter (nicht einmaliger) UID erlauben

source: use encrypted password for the new password
de_de: Ein verschlüsseltes Passwort als neues Passwort verwenden

source: new login shell for the user account
de_de: Neue Login-Shell für den Benutzerzugang

source: new UID for the user account
de_de: Neue UID des Benutzerzugangs

source: unlock the user account
de_de: Den Benutzerzugang entsperren

source: Error: Insufficient permissions to move home dir.
de_de: Fehler: Unzureichende Berechtigungen zum Verschieben des Home-Verschnisses

source: exit successfully if the group already exists, and cancel -g if the GID is already used
de_de: Ohne Fehler beenden, falls die Gruppe bereits existiert und Operation für -g abbrechen, falls die GID bereits verwendet wird

source: use GID for the new group
de_de: GID für die neue Gruppe benutzen

source: allow to create groups with duplicate (non-unique) GID
de_de: Erstellen einer Gruppe mit nicht einmaliger (doppelter) GID erlauben

source: encrypted password of the new group
de_de: Dieses verschlüsselte PASSWORT für die neue Gruppe verwenden

source: change the group ID to GID
de_de: Die Gruppen-ID auf GID ändern

source: change the name to NEW_GROUP
de_de: Den Gruppennamen auf NEUE_GRUPPE ändern

source: NEW_GROUP
de_de: NEUE_GRUPPE

source: allow to use a duplicate (non-unique) GID
de_de: Verwenden einer nicht einmaligen (doppelten) GID erlauben

source: change the password to this (encrypted) PASSWORD
de_de: Das Passwort auf dieses (verschlüsselte) PASSWORT ändern

source: Error: Group not found
de_de: Fehler: Gruppe nicht gefunden

source: "%s" is not a valid key/value pair
de_de: "%s" ist kein gültiges Schlüssel/Wert-Paar

source: "%s" is not a valid date
de_de: "%s" ist kein gültiges Datum
